In [1]:
import numpy as np
import pandas as pd

In [2]:
# use 2 decimal place for columns with float 
pd.set_option('display.float_format', lambda x: '%.2f' % x)

## Data Exploration

In [3]:
#Read the dataset
df = pd.read_excel("Market_Dataset.xlsx")
df

     revenue sales  price        country  year
0        NaN  3805  26339  United States  2013
1        NaN  3805  26339  United States  2013
2        NaN  3804  26328  United States  2014
3        NaN  3801  26335  United States  2015
4        NaN  3803      :  United States  2016
..       ...   ...    ...            ...   ...
109      NaN     -   9918       Colombia  2019
110      NaN   537   9910       Colombia  2020
111      NaN   547      -       Colombia  2021
112      NaN   549      :       Colombia  2022
113      NaN   549      :       Colombia  2022

[114 rows x 5 columns]

In [4]:
##We use the info to get information about the table

In [5]:
df.describe()

       revenue    year
count     0.00  114.00
mean       NaN 2017.49
std        NaN    2.92
min        NaN 2013.00
25%        NaN 2015.00
50%        NaN 2017.50
75%        NaN 2020.00
max        NaN 2022.00

In [6]:
df.isnull()

     revenue  sales  price  country   year
0       True  False  False    False  False
1       True  False  False    False  False
2       True  False  False    False  False
3       True  False  False    False  False
4       True  False  False    False  False
..       ...    ...    ...      ...    ...
109     True  False  False    False  False
110     True  False  False    False  False
111     True  False  False    False  False
112     True  False  False    False  False
113     True  False  False    False  False

[114 rows x 5 columns]

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114 entries, 0 to 113
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   revenue  0 non-null      float64
 1   sales    110 non-null    object
 2   price    114 non-null    object
 3   country  114 non-null    object
 4   year     114 non-null    int64
dtypes: float64(1), int64(1), object(3)
memory usage: 4.6+ KB

## Task 1:  Data Cleaning

### Formating of Datatype

In [8]:
# Sales Column
df['sales'] = pd.to_numeric(df['sales'], errors='coerce')
df['sales'].fillna(df['sales'].mode()[0], inplace=True)
df['sales'] = df['sales'].astype('int64')

In [9]:
# Price Column
df['price'] = pd.to_numeric(df['price'], errors='coerce')
df['price'].fillna(df['price'].mean(), inplace=True)

In [10]:
# Year Column
df["year"] = pd.to_datetime(df.year, format='%Y')
df['year'] = pd.to_datetime(df['year'])
df['year'] = df['year'].dt.year

In [11]:
#Count the time lapse of dataset
year =list(df['year'])
(year[-1]-year[0])

9

In [12]:
#country column
print(df['country'].unique())

['United States' 'united states' 'Germany' 'germany' 'GermanY'
 'United Kingdom' 'UNITED KINGDOM' 'united kingdom' 'China' 'ChinA'
 'Ghana' 'Australia' 'AustraIia' 'Brazil' 'BraziI' 'France' 'Italy'
 'ItaIy' 'Colombia' 'Col0mbia' 'COlombia']

In [13]:
#converting to lowercase and getting unique values
df['country'] = df['country'].str.lower() 
print(df['country'].unique())

['united states' 'germany' 'united kingdom' 'china' 'ghana' 'australia'
 'austraiia' 'brazil' 'brazii' 'france' 'italy' 'itaiy' 'colombia'
 'col0mbia']

In [14]:
country_dict = {'austraiia': 'australia',
               'brazii': 'brazil',
               'itaiy': 'italy',
               'col0mbia': 'colombia'}

df['country'] = df['country'].replace(country_dict)
df['country'] = df['country'].str.title()
df['country'].unique()

array(['United States', 'Germany', 'United Kingdom', 'China', 'Ghana',
       'Australia', 'Brazil', 'France', 'Italy', 'Colombia'], dtype=object)

In [15]:
df

     revenue  sales    price        country  year
0        NaN   3805 26339.00  United States  2013
1        NaN   3805 26339.00  United States  2013
2        NaN   3804 26328.00  United States  2014
3        NaN   3801 26335.00  United States  2015
4        NaN   3803 15946.86  United States  2016
..       ...    ...      ...            ...   ...
109      NaN    549  9918.00       Colombia  2019
110      NaN    537  9910.00       Colombia  2020
111      NaN    547 15946.86       Colombia  2021
112      NaN    549 15946.86       Colombia  2022
113      NaN    549 15946.86       Colombia  2022

[114 rows x 5 columns]

In [16]:
#statistical summary of the cleaned data
df.describe().T

         count     mean     std     min      25%      50%      75%      max
revenue   0.00      NaN     NaN     NaN      NaN      NaN      NaN      NaN
sales   114.00  2250.57 1879.85    0.00   610.25  1514.50  2935.75  6796.00
price   114.00 15946.86 6249.27 9041.00 12456.00 14116.50 16238.75 31101.00
year    114.00  2017.49    2.92 2013.00  2015.00  2017.50  2020.00  2022.00

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114 entries, 0 to 113
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   revenue  0 non-null      float64
 1   sales    114 non-null    int64
 2   price    114 non-null    float64
 3   country  114 non-null    object
 4   year     114 non-null    int64
dtypes: float64(2), int64(2), object(1)
memory usage: 4.6+ KB

In [18]:
df.shape

(114, 5)

In [19]:
df.drop_duplicates(inplace = True,  ignore_index = True)
df.shape

(110, 5)

## Task 2: Calculating Revenue

In [20]:
df['revenue'] = df['sales']*df['price']
df

         revenue  sales    price        country  year
0   100219895.00   3805 26339.00  United States  2013
1   100151712.00   3804 26328.00  United States  2014
2   100099335.00   3801 26335.00  United States  2015
3    60645892.49   3803 15946.86  United States  2016
4   100133274.00   3802 26337.00  United States  2017
..           ...    ...      ...            ...   ...
105   5442237.00    549  9913.00       Colombia  2018
106   5444982.00    549  9918.00       Colombia  2019
107   5321670.00    537  9910.00       Colombia  2020
108   8722930.11    547 15946.86       Colombia  2021
109   8754823.82    549 15946.86       Colombia  2022

[110 rows x 5 columns]

In [21]:
#Extracting table to excel file
df.to_excel('Market_Dataset_Clean.xlsx', index=False)

In [22]:
# Total Revenue for the priod of 9 years
df.revenue.sum()

3977238193.913461

In [23]:
country_revenue = df.groupby('country')['revenue'].sum().reset_index(name='revenue')
country_revenue

          country      revenue
0       Australia 564233720.60
1          Brazil 123455656.00
2           China 819863576.81
3        Colombia  60675817.92
4          France 163405028.00
5         Germany 342497004.60
6           Ghana  81850471.00
7           Italy 230187237.82
8  United Kingdom 714613591.68
9   United States 876456089.49

In [23]:
country_revenue.to_excel('country_revenue.xlsx', index=False)

In [24]:
#Data Source: statista.com